app/Http/Controllers/ContentController.php

select * from `maintainance_texts` limit 1
---
    public function maintainanceMode()
    {
        $maintainance = MaintainanceText::first();

select * from `maintainance_texts` limit 1
update `maintainance_texts` set `image` = 'uploads/maintainance/maintainance-mode-2026-05-16-04-52-24-7995.jpg', `maintainance_texts`.`updated_at` = '2026-05-16 16:52:25' where `id` = 1
---
    public function maintainanceModeUpdate(Request $request)
    {
        $rules = [
            'description'=> $request->maintainance_mode ? 'required' : ''
        ];
        $customMessages = [
            'description.required' => trans('admin_validation.Description is required'),
        ];
        $this->validate($request, $rules,$customMessages);

        $maintainance = MaintainanceText::first();
        if($request->image){
            $old_image=$maintainance->image;
            $image=$request->image;
            $ext=$image->getClientOriginalExtension();
            $image_name= 'maintainance-mode-'.date('Y-m-d-h-i-s-').rand(999,9999).'.'.$ext;
            $image_name='uploads/maintainance/'.$image_name;
            Image::make($image)
                ->save(public_path().'/'.$image_name);
            $maintainance->image=$image_name;
            $maintainance->save();