app/Http/Controllers/DepartmentController.php

  public function index()
{
    $departments = Department::with('manage')->paginate(7);
    // dd($departments->all());

    // Statistics for dashboard cards
    $totalDepartments = Department::count();
    $departmentsWithHeads = Department::whereNotNull('managers_id')->count();
    $departmentsWithoutHeads = Department::whereNull('managers_id')->count();
    $recentDepartments = Department::whereMonth('created_at', now()->month)->count();
---
select * from `departments` limit 7 offset 0
select count(*) as aggregate from `departments`
select count(*) as aggregate from `departments` where `managers_id` is not null
select count(*) as aggregate from `departments` where month(`created_at`) = '05'

    public function edit($id)
    {
        $department = Department::findOrFail($id);
---
select * from `departments` where `departments`.`id` = '1' limit 1

    public function update(Request $request, Department $department)
    {
        $request->validate([
            'name' => 'required',
            'code' => 'required|unique:departments,code,' . $department->id,
        ]);

        $department->update($request->all());
---
update `departments` set `manager_id` = '6', `departments`.`updated_at` = '2026-05-16 19:29:48' where `id` = 3