app/Http/Controllers/DepartmentController.php

select * from `departments` where `departments`.`id` = '3' limit 1
---
    public function edit($id)
    {
        $department = Department::findOrFail($id);