app/Http/Controllers/DocumentController.php

            }

            // Employee-specific documents
            $employee = Employee::findOrFail($employeeId);
---
select * from `employees` where `employees`.`id` in (49) and `employees`.`deleted_at` is null

    private function getGeneralStatistics()
    {
        return [
            'total_documents' => EmployeeDocument::count(),
            'active_documents' => EmployeeDocument::active()->count(),
            'verified_documents' => EmployeeDocument::verified()->count(),
            'expired_documents' => EmployeeDocument::expired()->count(),
            'expiring_soon' => EmployeeDocument::expiringSoon(30)->count(),
            'total_size' => EmployeeDocument::sum('file_size'),
            'by_type' => DocumentType::withCount('documents')->get(),
        ];
---
select count(*) as aggregate from `employee_documents` where `employee_documents`.`deleted_at` is null
select sum(`file_size`) as aggregate from `employee_documents` where `employee_documents`.`deleted_at` is null