app/Http/Controllers/EmployeeController.php

            return $item;
        });

        $totalCount = Employee::count();
---
select count(*) as aggregate from `employees` where `employees`.`deleted_at` is null