app/Http/Controllers/EmployeeController.php

    public function index(Request $request)
    {
        $name = 'Employees List';
    $zone   = 'employees';

        $employees = 'emplooyees';
        $count = Employee::count();

        // Filter parameters
        $jobTitle = $request->job_title;
        $region = $request->region;
        $gender = $request->gender;
        $educationLevel = $request->education_level;
        $status = $request->status; // active, inactive, all

        // Get distinct values for filters
        $jobTitles = Employee::select('job_title')
            ->distinct()
            ->whereNotNull('job_title')
            ->orderBy('job_title', 'ASC')
            ->pluck('job_title');

        $regions = Employee::select('region')
            ->distinct()
            ->whereNotNull('region')
            ->orderBy('region', 'ASC')
            ->pluck('region');

        $educationLevels = Employee::select('education_level')
            ->distinct()
            ->whereNotNull('education_level')
            ->orderBy('education_level', 'ASC')
            ->pluck('education_level');
---
select count(*) as aggregate from `employees` where `employees`.`deleted_at` is null
select distinct `job_title` from `employees` where `job_title` is not null and `employees`.`deleted_at` is null order by `job_title` asc
select distinct `region` from `employees` where `region` is not null and `employees`.`deleted_at` is null order by `region` asc
select distinct `education_level` from `employees` where `education_level` is not null and `employees`.`deleted_at` is null order by `education_level` asc

        });

        // Statistics for summary cards
        $totalCount = Employee::count();
        $regionCount = Employee::select('region')
        ->distinct()
        ->orderBy('region', 'ASC')
        ->pluck('region');
        $maleCount = Employee::where('gender', 'ወ')->count();
        $femaleCount = Employee::where('gender', 'ሴ')->count();
        $withDisability = Employee::whereNotNull('disability_type')->count();
        $rcount = Employee::select('region', DB::raw('count(*) as total'))->groupBy('region')->pluck('total', 'region')->toArray();
---
select count(*) as aggregate from `employees` where `employees`.`deleted_at` is null
select distinct `region` from `employees` where `employees`.`deleted_at` is null order by `region` asc
select count(*) as aggregate from `employees` where `gender` = 'ወ' and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `gender` = 'ሴ' and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where `disability_type` is not null and `employees`.`deleted_at` is null
select `region`, count(*) as total from `employees` where `employees`.`deleted_at` is null group by `region`

    public function edit($id)
    {
        $employee = Employee::findOrFail($id);
        $department = Department::get();
---
select * from `employees` where `employees`.`id` = '49' and `employees`.`deleted_at` is null limit 1
select * from `departments`

    public function update(Request $request, $id)
    {
        $employee = Employee::findOrFail($id);
---
select * from `employees` where `employees`.`id` = '49' and `employees`.`deleted_at` is null limit 1

        $validated['higher_ed_verified'] = $request->has('higher_ed_verified');

        // Update employee
        $employee->update($validated);
---
update `employees` set `photo` = 'uploads/employees/photos/1865352957544151.jpg', `employees`.`updated_at` = '2026-05-16 16:46:47' where `id` = 49