app/Http/Controllers/ExperienceController.php

select * from `employee_experiences` order by `created_at` desc limit 7 offset 0
select * from `employees` where `employees`.`id` in (6, 573, 574) and `employees`.`deleted_at` is null
select count(*) as aggregate from `employee_experiences`
select count(*) as aggregate from `employee_experiences` where `experience_type` = 'previous'
---
    public function index(Request $request)
    {
        try {
            $employeeId = $request->query('employee_id');
            $search = $request->query('search');

            // If no employee_id provided, show all experiences or redirect
            if (! $employeeId) {
                // Build query for all experiences
                $query = EmployeeExperience::with('employee');

                // Apply search if present
                if ($search) {
                    $query->where(function ($q) use ($search) {
                        $q->where('job_title', 'LIKE', "%{$search}%")
                          ->orWhere('institution', 'LIKE', "%{$search}%")
                          ->orWhereHas('employee', function ($emp) use ($search) {
                              $emp->where('employee_name', 'LIKE', "%{$search}%")
                                  ->orWhere('file_number', 'LIKE', "%{$search}%");
                          });
                    });
                }

                $experiences = $query->orderBy('created_at', 'desc')
                    ->paginate(7)
                    ->withQueryString();

                $totalExperiences = EmployeeExperience::count();
                $currentExperiences = EmployeeExperience::where('experience_type', 'current')->count();