app/Http/Controllers/ManagersController.php

  public function index()
{
    $department = Department::first();
    $managers = Managers::with('department')->paginate(7);
---
select * from `departments` limit 1
select * from `departments` where `departments`.`id` in (1, 2, 3, 4, 5, 6, 7)
select * from `managers` limit 7 offset 0
select count(*) as aggregate from `managers`